{"_name_or_path": "albert-base-v2", "architectures": ["AlbertForTokenClassification"], "attention_probs_dropout_prob": 0, "bos_token_id": 2, "classifier_dropout_prob": 0.1, "down_scale_factor": 1, "embedding_size": 128, "eos_token_id": 3, "gap_size": 0, "hidden_act": "gelu_new", "hidden_dropout_prob": 0, "hidden_size": 768, "id2label": {"0": "B-Transaction_Scalability", "1": "I-Transaction_Scalability", "2": "I-Software_Purpose", "3": "B-Development_Scalability", "4": "I-Development_Scalability", "5": "B-Userbase_Information", "6": "I-Userbase_Information", "7": "B-Data_Scalability", "8": "I-CS_Name", "9": "B-Software_Purpose", "10": "B-Internal_Organization", "11": "I-Internal_Organization", "12": "I-Data_Scalability", "13": "B-CS_Name", "14": "O"}, "initializer_range": 0.02, "inner_group_num": 1, "intermediate_size": 3072, "label2id": {"B-Transaction_Scalability": "0", "I-Transaction_Scalability": "1", "I-Software_Purpose": "2", "B-Development_Scalability": "3", "I-Development_Scalability": "4", "B-Userbase_Information": "5", "I-Userbase_Information": "6", "B-Data_Scalability": "7", "I-CS_Name": "8", "B-Software_Purpose": "9", "B-Internal_Organization": "10", "I-Internal_Organization": "11", "I-Data_Scalability": "12", "B-CS_Name": "13", "O": "14"}, "layer_norm_eps": 1e-12, "max_position_embeddings": 512, "model_type": "albert", "net_structure_type": 0, "num_attention_heads": 12, "num_hidden_groups": 1, "num_hidden_layers": 12, "num_memory_blocks": 0, "pad_token_id": 0, "position_embedding_type": "absolute", "torch_dtype": "float32", "transformers_version": "4.30.2", "type_vocab_size": 2, "vocab_size": 30000}